/*
 * Team9
 * Magic Shooting
 * app.pde
 */

//====================================================
// クラス
//====================================================

GameManager game;

//====================================================
// setup
//====================================================

void setup() {

  // 画面サイズ
  size(SCREEN_WIDTH, SCREEN_HEIGHT);

  // フレームレート
  frameRate(FPS);

  // 描画を滑らかにする
  smooth();

  // 描画モード
  imageMode(CENTER);
  rectMode(CENTER);
  ellipseMode(CENTER);

  // 文字位置
  textAlign(CENTER, CENTER);

  // フォント
  gameFont = createFont("Meiryo", 24);
  textFont(gameFont);

  // ゲーム生成
  game = new GameManager();

}

//====================================================
// draw
//====================================================

void draw() {

  background(0);

  game.update();

  game.draw();

}

//====================================================
// マウスクリック
//====================================================

void mousePressed() {

  game.mousePressed();

}

//====================================================
// マウス移動
//====================================================

void mouseMoved() {

  game.mouseMoved(mouseX, mouseY);

}

//====================================================
// マウスドラッグ
//====================================================

void mouseDragged() {

  game.mouseMoved(mouseX, mouseY);

}

//====================================================
// キー入力
//====================================================

void keyPressed() {

  game.keyPressed(key);

}

//====================================================
// キーを離した
//====================================================

void keyReleased() {

  game.keyReleased(key);

}